data1 = '07.01.2023'
new_data = ''
days  = {'01':'понедельник', '02':'вторник', '03':'среда', '04':'четверг','05':'пятница','06':'суббота','07':'воскресение'}
for key in days.keys():
    if key == data1[0:2]:
        new_data += days[key]
months = {'01':'январь','02':'февраль','03':'март','04':'апрель','05':'май','06':'июнь','07':'июль','08':'август','09':'сентябрь','10':'октябрь','11':'ноябрь','12':'декабрь'}
for key in months.keys():
    if key == data1[3:5]:
        new_data += f' {months[key]} {data1[6:]} года'
print(new_data)
